{
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity",
  "createdDateTime": "2024-08-17T16:22:39.1787157Z",
  "creationSource": null,
  "description": "",
  "lastModifiedDateTime": "2024-08-17T16:22:39.1787157Z",
  "name": "MacOS - OIB - Microsoft Edge - D - Password Management - v1.0",
  "platforms": "macOS",
  "priorityMetaData": null,
  "roleScopeTagIds": ["0"],
  "settingCount": 3,
  "technologies": "mdm,appleRemoteManagement",
  "id": "ce785d46-6213-41c1-9b8a-16f4d897b231",
  "templateReference": {
    "templateId": "",
    "templateFamily": "none",
    "templateDisplayName": null,
    "templateDisplayVersion": null
  },
  "settings": [
    {
      "id": "0",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "com.apple.managedclient.preferences_passwordmonitorallowed",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "settingValueTemplateReference": null,
          "value": "com.apple.managedclient.preferences_passwordmonitorallowed_true",
          "children": []
        }
      }
    },
    {
      "id": "1",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "com.apple.managedclient.preferences_passwordprotectionwarningtrigger",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "settingValueTemplateReference": null,
          "value": "com.apple.managedclient.preferences_passwordprotectionwarningtrigger_1",
          "children": []
        }
      }
    },
    {
      "id": "2",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "com.apple.managedclient.preferences_passwordmanagerenabled",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "settingValueTemplateReference": null,
          "value": "com.apple.managedclient.preferences_passwordmanagerenabled_true",
          "children": []
        }
      }
    }
  ]
}
